tutorials/incompressible/pisoFoam/LES/motorBike/motorBike/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(front|back)"
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    upperWall
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    "motorBike_.*"
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
